// ConsoleApplication3.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

int main()
{
	int n,i,a,b=0;
	scanf("%d", &n);
	int number[10000];
	for (i = 0; i < n; i++)
	{
		scanf("%d", &number[i]);
	}
	scanf("%d", &a);
	for (i = 0; i < n; i++)
	{
		if (number[i] == a)
		{
			b++;
		}
	}
	printf("%d", b);
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件任务描述
//题目描述：给出一个包含n个整数的数列，问整数a在数列中的第一次出现是第几个。
//
//相关知识（略）
//编程要求
//根据提示，在右侧编辑器Begin - End处补充代码。
//输入
//第一行包含一个整数n。
//第二行包含n个非负整数，为给定的数列，数列中的每个数都不大于10000。
//第三行包含一个整数a，为待查找的数。
//输出
//如果a在数列中出现了，输出它第一次出现的位置(位置从1开始编号)，否则输出 - 1。
//
//测试说明
//样例输入：
//6
//1 9 4 8 3 9
//9
//样例输出：
//2
//提示：
//数据规模与约定。
//1 <= n <= 1000


