// c10_26.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//

#include <iostream>

int main()
{
    int number[11];
    int i, j, k;
    for (i = 0; i < 10; i++)
    {
        scanf("%d", &number[i]);
    }//输入数组
    for (i = 0; i < 10; i++)
    {
        int min = number[i];
        for (k = i; k < 10; k++)//对第几个开始比较大小
        {
            if (min > number[k])
            {
                min = number[k];
                j = k;
            }
        }
        number[j] = number[i];
        number[i] = min;//将两个数值替换
    }//大小排序
    for (i = 0; i < 10; i++)
    {
        printf("%d ",number[i]);
    }
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单
//7 12 54 21 745 36 58 96 11 0
// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
